MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX174F256D.atdf
         <register caption="" name="DSGPR6" offset="0x54" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR7" offset="0x58" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR8" offset="0x5c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR9" offset="0x60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR10" offset="0x64" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR11" offset="0x68" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR12" offset="0x6c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR13" offset="0x70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR14" offset="0x74" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR15" offset="0x78" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR16" offset="0x7c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR17" offset="0x80" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR18" offset="0x84" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR19" offset="0x88" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR20" offset="0x8c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR21" offset="0x90" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR22" offset="0x94" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR23" offset="0x98" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR24" offset="0x9c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR25" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR26" offset="0xa4" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR27" offset="0xa8" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR28" offset="0xac" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR29" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR30" offset="0xb4" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR31" offset="0xb8" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR32" offset="0xbc" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
      </register-group>
      <value-group caption="IO Pin State Release bit" name="DSCON__RELEASE">
         <value caption="Upon waking from Deep Sleep, the IO pins maintain their previous states" name="" value="0x1" />
         <value caption="Release IO pins and allow their respective TRIS and LAT bits to control their states" name="" value="0x0" />
      </value-group>
      <value-group caption="Deep Sleep BOR Event Status bit" name="DSCON__DSBOR">
         <value caption="DSBOREN was enabled and VDD dropped below the DSBOR threshold during Deep Sleep" name="" value="0x1" />
         <value caption="DSBOREN was disabled, or VDD did not drop below the DSBOR threshold during Deep Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake-up Source Disable bit" name="DSCON__WAKEDIS">
         <value caption="External wake-up source is disabled" name="" value="0x1" />
         <value caption="External wake-up source is enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC Wake-up Disable bit" name="DSCON__RTCCWDIS">
         <value caption="Wake-up from RTCC is disabled" name="" value="0x1" />
         <value caption="Wake-up from RTCC is enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC Module Disable bit" name="DSCON__RTCDIS">
         <value caption="RTCC module is not enabled" name="" value="0x1" />
         <value caption="RTCC module is enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="General Purpose Registers Enable bit" name="DSCON__DSGPREN">
         <value caption="General purpose register retention is enabled in Deep Sleep mode" name="" value="0x1" />
         <value caption="No general purpose register retention in Deep Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Deep Sleep Enable bit" name="DSCON__DSEN">
         <value caption="Deep Sleep mode is entered on a WAIT command" name="" value="0x1" />
         <value caption="Sleep mode is entered on a WAIT command" name="" value="0x0" />
      </value-group>
      <value-group caption="MCLR Event bit" name="DSWAKE__DSMCLR">
         <value caption="The MCLR pin was active and was asserted during Deep Sleep" name="" value="0x1" />
         <value caption="The MCLR pin was not active, or was active, but not asserted during Deep Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Real-Time Clock and Calendar Alarm bit" name="DSWAKE__DSRTC">
         <value caption="The Real-Time Clock and Calendar triggered an alarm during Deep Sleep" name="" value="0x1" />
         <value caption="The Real-Time Clock and Calendar did not trigger an alarm during Deep Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Time-out bit" name="DSWAKE__DSWDT">
         <value caption="The Deep Sleep Watchdog Timer timed out during Deep Sleep" name="" value="0x1" />
         <value caption="The Deep Sleep Watchdog Timer did not time-out during Deep Sleep" name="" value="0x0" />
      </value-group>
